export const sellerLineGraph = [
  {
    id: "월 수익 금액",
    color: "hsl(324, 70%, 50%)",
    data: [
      {
        x: "사업자 등록",
        y: 0,
      },
      {
        x: "2021년 7월",
        y: 12034,
      },
      {
        x: "2021년 8월",
        y: 29871,
      },
      {
        x: "2021년 9월",
        y: 10234,
      },
      {
        x: "2021년 10월",
        y: 8900,
      },
      {
        x: "2021년 11월",
        y: 20192,
      },
      {
        x: "2021년 12월",
        y: 18293,
      },
      {
        x: "2022년 1월",
        y: 34012,
      },
    ],
  },
  {
    id: "총 수익 금액",
    color: "hsl(211, 70%, 50%)",
    data: [
      {
        x: "사업자 등록",
        y: 0,
      },
      {
        x: "2021년 7월",
        y: 12034,
      },
      {
        x: "2021년 8월",
        y: 41905,
      },
      {
        x: "2021년 9월",
        y: 52139,
      },
      {
        x: "2021년 10월",
        y: 61039,
      },
      {
        x: "2021년 11월",
        y: 81231,
      },
      {
        x: "2021년 12월",
        y: 99524,
      },
      {
        x: "2022년 1월",
        y: 133536,
      },
    ],
  },
  {
    id: "넘버원 업체 평균 예약 건 수",
    color: "hsl(211, 70%, 50%)",
    data: [
      {
        x: "2021년 7월",
        y: 12102,
      },
      {
        x: "2021년 8월",
        y: 14131,
      },
      {
        x: "2021년 9월",
        y: 9224,
      },
      {
        x: "2021년 10월",
        y: 20324,
      },
      {
        x: "2021년 11월",
        y: 14304,
      },
      {
        x: "2021년 12월",
        y: 21002,
      },
      {
        x: "2022년 1월",
        y: 23009,
      },
    ],
  },
];

export const sellerPieGraph = [
  {
    id: "20대",
    label: "20대",
    value: 542,
    color: "hsl(272, 70%, 50%)",
  },
  {
    id: "30대",
    label: "30대",
    value: 518,
    color: "hsl(199, 70%, 50%)",
  },
  {
    id: "40대",
    label: "40대",
    value: 403,
    color: "hsl(119, 70%, 50%)",
  },
  {
    id: "50대",
    label: "50대",
    value: 327,
    color: "hsl(272, 70%, 50%)",
  },
  {
    id: "10대",
    label: "10대",
    value: 239,
    color: "hsl(321, 70%, 50%)",
  },
  {
    id: "60대",
    label: "60대",
    value: 220,
    color: "hsl(67, 70%, 50%)",
  },
  {
    id: "70대",
    label: "70대",
    value: 183,
    color: "hsl(272, 70%, 50%)",
  },

  {
    id: "80대 이상",
    label: "80대 이상",
    value: 97,
    color: "hsl(272, 70%, 50%)",
  },
];
